[
{"text": "I got these for my 8 and 10 year old boys, and they fit great. My son said they are comfortable and soft.", "rating": "5.0 out of 5 stars"},
{"text": "CAUTION: This is NOT RETURNABLE. In spite of it being sold by Amazon. Please be aware.The sizing is inconsistent and shrinks beyond a comfortable fit. The manufacturer could’ve preshrunk at the very least.During this pandemic, we are all learning about quality controls and responsible manufacturing, or lack thereof, among vendors on Amazon, if not, Amazon itself.Most of us with long enough histories with Amazon, learned early on that poor quality and product oversight was not a given with Amazon. Sadly, not even with products bearing the Amazon name.Herewith, another case in point and a buyer warning. TAKEAWAY: Don’t buy these, and confirm 100% refund before purchasing anything on Amazon. No matter if it’s sold by them.", "rating": "1.0 out of 5 stars"},
{"text": "When these first arrived, the first thing I noticed was how large they appeared. I got them to replace the disposable ones that my fiance and I have been using, because they felt wasteful. I purchased the small/medium and the large/x-large, thinking we'd need two different sizes since I'm much smaller than he is. The Small/medium arrived first and were too big even for him. I washed them and they did appear to shrink a little, but after wearing them for one outing, they stretched out again. I think these do the trick if you're wearing them for a few minutes at the time, and if you wash them...after every use? I would save your money and buy something else.I haven't even opened the large ones, I'll probably just return them.", "rating": "3.0 out of 5 stars"},
{"text": "It fits perfectly with size large. I am 6\" and 185lbs. I have tried a few different  masks but these fits me way better than others.", "rating": "5.0 out of 5 stars"},
{"text": "El tamaño es demasiado grande , mi estatura es de 1.87 metros ,cuerpo robusto y aun así me quedo grande , no me gustaron", "rating": "1.0 out of 5 stars"},
{"text": "At this price for four masks for my children, I thought it was worth taking a chance on the product. It was not. I washed they before use on a delicate cycle and hung them to dry. They are already coming apart, and that's before the kids even had a chance to wear them. They are also pretty thin and quality seems to be off. Again, I'm not surprised as it was by far the cheapest fabric masks I've seen, so I guess you get what you pay for.", "rating": "1.0 out of 5 stars"},
{"text": "I was having trouble getting my son masks that didn’t hurt his ears (he was getting sores behind his ears from the hard string /fabric ) and ones that actually fit his little 4 year old face :) so I came across these ones and took a chance! There cute , soft but not so soft to where they are flimsy .... cool colors which was a plus! The ear wrap is very gentle and he never had red ears or complained +++++++ thank goodness! Machine washable . There isn’t a filter or anything but for my little guy we never plan to be out long or in bit groups of people so that’s not a issue for us .... for the color ,quality , and fast shipping it’s worth it to me", "rating": "5.0 out of 5 stars"},
{"text": "Kids size fits my average sized 6 year old daughter but was too tight for my tall 9 year old. Thinner soft comfy material, easy to wear", "rating": "5.0 out of 5 stars"},
{"text": "The masks themselves are as pictured, and I actually do like this type of sort of jersey knit mask (like T-shirt material), but the sizing is way off, at least for the \"Big Kids\" size.  I don't know what they deem a big kid, but I would think at least maybe 8 or 10 years old, would be a big kid right?  This would probably fit up to maybe pre-K or 5 years old.  Oh, and BEWARE...these are not returnable via the usual Amazon returns due to hygiene concerns.  I had to go through Customer Service (chat) to get them to refund my money (which they graciously did, but it was a bit of a hassle).  I guess I'll look for another source for masks, now that I know you can't return these if they don't fit.", "rating": "2.0 out of 5 stars"},
{"text": "Wired design where the strings over the ears are too short and the mask too big. We had three people try the masks and these just don't fit tight whatsoever (don't seal the face in and big gaps on the sides). Be aware you can't return this item. Wouldn't order them again.", "rating": "1.0 out of 5 stars"},
{"text": "I started buying masks for my family back in June when I saw the writing on the wall that they would be required if my kids were ever going to be able to go back to school. We bought custom masks from Etsy, made to order for our face measurements, we bought disposables, multi-packs of adjustable masks in different styles, even neck gators before it was decided they weren't helpful.  These are hands down the most comfortable ones we own.  I ordered Adult Sm/Med for all of us. They fit both myself and my kids (ages 12-17) better than their custom ones and are everyone's favorite masks.  We're just waiting and hoping the plain colors come back in stock so we can order more.", "rating": "5.0 out of 5 stars"},
{"text": "These are the best masks I have found and the only masks that fit me. I am a small 75 year-old woman and have a small face. Every adult mask is too large and won't stay up. I have tried a couple of children's masks but they weren't comfortable and didn't fit well. Most I didn't even try as I am not yet at the point of wearing cartoons on my face. :) I bought the big kids masks because I like the bright colors, as well as black, and the measurements for the big kids size were the right ones to fit me. These masks fit perfectly. They are soft, fairly thick, and easy to breathe through. Also, they are not hot. They don't have a bendable nose band, but they are sewn with darts so they are contoured to fit well. I am very happy with these masks. The price is good for the quality of the mask. I highly recommend them.", "rating": "5.0 out of 5 stars"},
{"text": "At first, these were amazing. They were much easier to breathe in than the homemade masks that I had made at the start of the pandemic and I appreciated that they were a thick jersey material while still being comfortable. When they arrived, the four colors were a variety of sizes to begin with which was odd. The white one was the loosest and was great for walking the dog. However, after being washed frequently (which is just plain necessary) they could now fit a child. In fact, I donated them to my friend with a pre-teen who fell into the gap of adult masks being too big and child masks being too small and they worked great for her. They just don't maintain their shape at all and I wonder how much they'll continue to shrink. They also hold onto lint like crazy and I cannot express vehemently in the English language how annoying it is to have lint tickling your nose in public. There are better options out there and I do not recommend these.", "rating": "1.0 out of 5 stars"},
{"text": "These have a peak at the top & are straight across the bottom. Looks different in the pictures.Although they are designed with a peak at the nose bridge, there is no wire inside. On me, they hang open at the top if worn that way - defeating the purpose. Like a lot of women, I have a kind of small head. I have to wear them upside down so that the peak is under my chin, in order to fit snugly.The material is soft & comfortable.  Washed on gentle with cold water & hung dry - they held their shape.", "rating": "4.0 out of 5 stars"},
{"text": "Seems like the masks were made as an after thought with leftover material from a shirt. One of the straps was separated from the mask on delivery. Mask sizes vary in the same pack, ine pack of large has ine mask that fits and two that are too small while one is far too big.One of my masks was even lopsided, if you folded down the center seem the left half was about an inch longer, so when you out this mask on one side hangs of your face. The other struggles to reach the ear.Not sure why Amazon is still carrying this predatory product targeting those who need masks.Honestly I just hope refunding is an option so I can buy a mask that actually works", "rating": "1.0 out of 5 stars"},
{"text": "I can't Amazon sell such product with their name on... really lose fabric, not tightly woven, the ear loops aren't rubber band... it's the same clothes!  Super uncomfortable with zero effect really.  This is the first time that I am so disappointed with Amazon Brand...!!", "rating": "1.0 out of 5 stars"},
{"text": "I purchased the masks for my toddler. It was good fit for her, easy to breath and I like the fabric which was really soft.", "rating": "5.0 out of 5 stars"},
{"text": "The ‘little kid’ size is too small for 3 (pre k) and 5 (kindergarten).There’s no stretch in the loops that go over the ears.There’s no groove for a nose.They are made out of t shirt material on both front and loops but there’s no stretch to the loops.There’s no slot for a filter.Overall I would Strongly NOT recommend these.Each one is a different color.Since there’s no stretch, and they don’t fit, they are essentially useless pieces of small fabric that I just wasted nearly $20 on. (And probably cant return because eww, they’ve been tried on toddlers mouths.)", "rating": "1.0 out of 5 stars"},
{"text": "This face covering does not fit properly on your face. It wasn't cut correctly and cannot be adjusted.You can tell the reviews are paid for by the seller due to their poor English. They will not accept returns since this item can carry the infection.", "rating": "1.0 out of 5 stars"},
{"text": "My 5-year-old was not able to even get these on her face because they were way too small. The ear loops were way too short and not very stretchy so there was no way she could wear it as is. It is not eligible for returns so I will be looking for elastic to replace the ear loops just so we can use them. Otherwise we liked the color and pattern and the softness of the fabric.", "rating": "1.0 out of 5 stars"},
{"text": "Fit is perfect ! And quality is very good.", "rating": "5.0 out of 5 stars"},
{"text": "We ended up buying these during the Prime Day deals in order to have additional masks to use. We've had a hard time finding a mask to fit decently over a good-sized beard that aren't super large or uncomfortable, but these (XL adult size) have been excellent.  Masks are two-layers, but stretchy and breathable.Out of the packaging, they are absolutely massive (comically so)! However, the instructions ask that you wash before use. I did find that they shrunk a little bit after the initial wash, but they were still large enough to fit over a beard without too much stretch. I find that washing them (any other cloth mask) in a delicates garment bag, and low/tumble dry help keep these in good shape!If you have a beard like I do, I strongly recommend these", "rating": "5.0 out of 5 stars"},
{"text": "I am a man with a big head. I got the large/extra large. After I washed and dried these, It was a tight on the first try-on. I stretched one out while it was still warm from the drier. I overstretched it. I tried again with one that had cooled off. I did have to stretch it a lil bit, but it fits good, doesn't tug at my ears. These are soft, comfortable, so much nicer than the throw away masks. I have no complaints about these masks. Be careful not to overstretch.Update- The mask that I overstretched after the first wash right after I received the masks, has gone back to a good fit after another normal wash and dry cycle. I'm happy with these masks.", "rating": "5.0 out of 5 stars"},
{"text": "These are clownishly large, even for my husband's larger-than-normal head. Adjusting them doesn't work, the \"large\" looks like a giant drape that goes into his eyes.The WORST part about these is there is absolutely no refund, even for a defective, non-workable item. If the item doesn't work, too bad, so sad, they got their money. No refunds, no exchanges, nothing.DO NOT BUY FROM THIS SELLER!", "rating": "1.0 out of 5 stars"},
{"text": "It was recommended by a doctor on TV that the KF94 masks would be among the best to prevent spread of the corona virus.  I ordered them for my husband and myself.  They are extremely comfortable and fit tight to the face which is why they help to prevent the virus from spreading.  I was surprised to discover that I could breathe better through them than some of the other paper and homemade masks I had been using.  The doctor said there would be no reason to wear a second mask with this one, although I feel more comfortable in crowded situations with the extra mask on top.  They fit so closely to my nose that my eyeglasses fog a bit less.", "rating": "5.0 out of 5 stars"},
{"text": "These are pieces of crap!! Unfortunately I purchased when there were no reviews. They finally arrived and the masks are all lopsided. See my photo! I folded it at the front seam and nothing lines up, which means the masks won’t line up on your face either.  I tried to return it and I got a “non returnable” message.  I’m pretty pissed. Just another third party seller shipping cheap product to amazon warehouses for redistribution.", "rating": "1.0 out of 5 stars"},
{"text": "Should have read the ONE other review before I got these lol. I heard that they would start fining people without masks so I panic bought these and they suuuuck.They’re too big and uncomfortable as hell. I had to tie hair ties around it to keep it up and it pokes me in the lower lash line and hurts the ears. My fiancé can’t wear them at all.Go to Walgreens and get the disposable ones. They’re cheaper and fit.", "rating": "1.0 out of 5 stars"},
{"text": "These are very nice face masks. They are cotton, not cotton polyester and are made EXTREMELY WELL made! I bought the \"big kids\" size for her as she is 9 yrs old and they were a tiny bit snug at first. I hand washed them and gently pulled on them before hang drying. They washed and dried great and then I gently pulled on all sides again and they fit her great! They did not slide down her nose and stayed put. Best face masks so far!!", "rating": "5.0 out of 5 stars"},
{"text": "I’m not one to write write negative reviews but the fact this isn’t returnable is disappointing.  Very think, light weight material.  I thought I’d like them since they are 100% cotton but they are too flimsy and do not fit well.  I like thin masks, to be honest, but these just don’t fit well.You will NOT BE ABLE TO RETURN! It says sold by Amazon, but they will not accept returns.  Please do yourself a favor and buy another kind.  I’m truly disappointed and would hate to see ppl being robbed like this.DO NOT BUY!!!", "rating": "1.0 out of 5 stars"},
{"text": "The fabric feels soft and comfortable like a t-shirt, they are pretty light-weight, and it seems to be easy to breathe while wearing them, but they are too big for me. They fall down my nose, and there is a lot of extra fabric past my chin. My glasses do not help make it stay on my nose, and I have some problems with the mask fogging my glasses up. I think that by adding a couple of stitches I can adjust them to fit me better, so I can still use them. I am an average sized female in my 20’s, and after reading reviews, I decided to order the Adult Small/Medium size. Many people complained about how the Large/Extra Large masks were too big, but reviews for the smaller children’s size say that those are too small for children. Unlike reviews that I read, all 4 of the masks in the package are the same size, and seem to have been made pretty consistently. I think that they are okay, but it will take a bit of effort to make them work for me.", "rating": "3.0 out of 5 stars"},
{"text": "I was hoping that ordering an x-large face masks it would cover more of my face and it certainly does that, except for one big problem they don't stay on your nose the material is too loose and there is no nose clip in these. I washed them in hot water and threw them in the dryer, which seems to have helped with the nose issue and has made it a little snugger from ear to ear. I noticed however that the all black color now looks like it has been washed a lot and it has a faded look to it now. I will know in the future not to order an extra large in a face masks.", "rating": "4.0 out of 5 stars"},
{"text": "The XL size face masks are so small I would not like to see what a regular or kid size looks like.  They take too too long to arrive and to compound the delay in shipping -- extremely small size -- you can't send it back (and it is an AMAZON labeled product).  If I could give this product and experience a NEGATIVE number I would.Buy from other vendor if you must buy on Amazon...bad experience.", "rating": "1.0 out of 5 stars"},
{"text": "I purchased this for my two toddler boys, ages 4 & 2. These masks are too small for my 2 year old and I couldnt even get them on my 4 year old. When he tries to wear them they pull his ears forward and cause pain. We have other little kid face masks so I know they don't have a problem wearing masks, just these ones. And then because they are masks I can't return or exchange them. Do not purchase these! They are way too small.", "rating": "1.0 out of 5 stars"},
{"text": "I got the Little kid size for my 6 year old and it was not even close to fitting, ( these items are not eligible for return... did not know that)  Since they are the style that fits his face the best i bought the Big kids and those are even tight,  so 36 dollars later we have 4 masks that we need to stretch a bit to fit comfortably for the 4 hours he is in school", "rating": "3.0 out of 5 stars"},
{"text": "The first thing I noticed was the ear loops did not stretch much so there is no slack getting the loops around the ears. It took a minute & is a tight fit. The large/xl seems to refer to the size of the mask cover as it covers ear to ear. It doesn’t have a nose piece but the tight fit once it’s on takes care of it. Once you have it on it’s actually comfortable for breathing and it doesn’t slip off anywhere. This mask has its pluses & minuses. Perhaps if you are a creative kind you could attach your own ear loops to the ends to make it comfy on the ears.", "rating": "3.0 out of 5 stars"},
{"text": "The sizing is inaccurate, and doesn't fit as expected. First I ordered a Large/XL Adult expecting an extra large. It was too small, and did not fit as expected. Afterwards I ordered a small/medium Adult expecting a medium for another person. They said it was too large and that it did not fit them as expected.When comparing the 2 sizes, you'll notice a 1-2cm difference between the medium and CL. I even added an image with the medium place on top of an XL.They refunded the first set, which was real nice. Then the 2nd was refused a refund since the business doesn't accept return shipping. We really cannot argue against the logic there.Due to my experience here, I would have to recommend buying from someone else. Preferably someone that has an accurate description for sizing proportions. It is beneficial towards customer satisfaction, since it would avoid this issue issue to begin with", "rating": "2.0 out of 5 stars"},
{"text": "These are masks that fit my 9 and 11 year old daughters well. They are t-shirt like fabric, but 2 layers, so not super thin.  hey cover the whole bottom half of their faces, but are fitted to their face and not bulky.  One of my daughters has a tshirt like mask she likes a lot because it doesn't fog up her glasses somehow and I thought these might be good replacements as they're similar style and that ones getting stretched out, but they do fog her glasses like most other masks.", "rating": "5.0 out of 5 stars"},
{"text": "Arrived within 2 days! Very fast shipping. The face masks I received look identical to the picture displayed on here. Two of them seem a tiny bit smaller but they all fit good. I’m 23, and I have a fairly small head so I ordered the big kid size. It fits so I am very pleased. Not sure why so many negative reviews?? I’m pretty happy with what I received and now I have something to wear at my job and when I got out an about. :)", "rating": "5.0 out of 5 stars"},
{"text": "I ordered these for 3 of my kids, ages 2, 4, and 5(lol yes with a new year came a new child 😂). Alright so it fits my 2 year old the best with a little extra room, but covers nose and mouth properly. It’s a bit snug on my 4 and 5 year old. My 5 year old complains about it looking like some underwear lol(kind of does). The masks definitely fits my 5 yeah old too tight and she’s tall and slim. If I remember right the seller offers little kids and big kids sizes....so I definitely recommend going with big kid size for children 4 and up. Oh and it’s designed like half face masks...there’s no special cut out/shaping for the nose. Good material and threading.", "rating": "4.0 out of 5 stars"},
{"text": "First of all, I just wanted one of good quality, not 4 of bad quality! They are too large and don't stay up over my nose. The ear loops are fabric material and no stretch to them.  Of course they're non returnable. I would just stick to the cheap surgical ones. I'm thinking of sewing them together since they are so thin, and adding some elastic and a nose bridge.  What a pain!  I am a terrible seamstress too! They cost just as much as the others.  I hope they are a better quality!", "rating": "1.0 out of 5 stars"},
{"text": "I have an average sized head. These masks pull my ears forward, have gaps on the sides, and don’t fit right on the bridge of my nose. They slide down on my nose and cause my glasses to steam up more than the disposable masks do. I recommend buying disposable masks rather than getting these.", "rating": "2.0 out of 5 stars"},
{"text": "Way too small. I bought the Kids “Big Kid” size for my 8 and 10 year old boys, and they are way too small. (Both my boys are small- average sized). They fit my 2 year old better. So size up when ordering. They are colorful and soft. They have some stretch to them but not a lot. Again, they just run small.", "rating": "3.0 out of 5 stars"},
{"text": "THere is no size marking on the masks, so I'm not sure how you can know whether or not you receive the correct size. In my case, I ordered small/medium masks, but the masks I received were definitly not small, in fact they were larger than the average size masks I already have! But since they are cotton, and are cute looking, I decided to try washing them in hot water to see if they would shrink. They didn't, so now I will probably have to modifiy them to be able to use them.", "rating": "3.0 out of 5 stars"},
{"text": "These are soft but in the pack of 4 there were three different sizes when held next to each other.  One was very small compared to the others.  The ear loops are not quite big enough on the other 3.  I would say these may fit up to maybe an 8 year old.  Get the big kids if you need for 8-10 ish aged child.  It is hard to find a good kids mask they will wear.", "rating": "3.0 out of 5 stars"},
{"text": "I ordered the small/med adult for my 15 year-old daughter and each one in the pkg fit differently. The black one seemed to be sized accurately and fit her well. The other 3 were enormous. They are even too large for my husband to wear. How these are considered small/med makes no sense. The fabric is very soft but since these masks are not adjustable, it was really not worth the price since only one from pack of 4 is sized correctly and usable.", "rating": "2.0 out of 5 stars"},
{"text": "This product is horrible on size accurate see it says this is supposed to be a medium/small it’s more like a large/extra large and all of the masks are different sizes so they get from big to even bigger beware don’t waste your money because you cannot return....", "rating": "1.0 out of 5 stars"},
{"text": "The masks look as advertised.  Only one of the 4 was big enough for my 9 year old, but after pulling and stretching the other 3, they will now work on my 11 year old daughter (she has the smaller face, though she is the older one).  Material is soft.  Ok for the money.  Just cotton masks- Not going to prevent Covid particles from coming in but will catch coughs/sneezes so it should fulfill its purpose of preventing large droplets from getting out (we are wearing the masks mostly to protect others, not ourselves as they say).", "rating": "4.0 out of 5 stars"},
{"text": "It’s now summer and wearing this mask is pretty unbearable. I realize the point of the mask but keeping it on, even indoors, is suffocating for more than 10 minutes.  And there is no way to prevent your breath from fogging your glasses.If you’re only using for short periods of times in a cool climate they are fine (provides you also don’t wear glasses). Otherwise get something else.", "rating": "2.0 out of 5 stars"},
{"text": "These have become my go to mask. They are a little warm in the summer since they are a double thickness, but perfect for the winter. They have stretch, but do not stretch out of shape when you are wearing them and have to take them off and on several times. I do not put them in the washing machine, but wash them by hand. I put a little bit of fabric softener at the end so there is a pleasant smell when I wear them.", "rating": "5.0 out of 5 stars"},
{"text": "I have a round face so got the large size and they fit okay upon arrival but I wanted to toss them all in the wash before actual use. Afterwards, they lost any stretch around the edges!  I don't know that I've often experienced something getting *bigger* after washing but that feels like the case here. I'm going to have to cut and sew the ear straps just to get them to work. I ordered the small size for some family members and now regret giving them what might be a shoddy product.", "rating": "2.0 out of 5 stars"},
{"text": "I have what I would consider to be an average sized head for a man. The small to medium-sized mask is un-wearable a it Dumbo's my ears so badly that it won't stay on. The medium-large on the other hand is so big that it doesn't even come close the ceiling around my cheeks or nose. It is poorly shaped and functionally useless. I even tried washing the larger masks to see if I could shrink them to the point of being useful which resulted in no improvement.", "rating": "1.0 out of 5 stars"},
{"text": "First of all.. These masks are exactly what I need when I gotta step out of my apartment. Such a perfect fit, and very comfortable. Quality is great.. If I would have known about these sooner... it would have saved me the headaches i had to go through on ordering other masks!", "rating": "5.0 out of 5 stars"},
{"text": "These are not as advertised.  I measured carefully for my 7yo and ordered the correct size, according to the website description. Of the 4 masks (which she did think were very cute), only 1 actually fit with the other 3 in various degrees of being too small. So beware that they may not all be the same size, and although this is an Amazon product they do not allow returns and don’t offer any option to make it right for their defective product.", "rating": "1.0 out of 5 stars"},
{"text": "Horrible! They’re HUGE. I have a big face and it still went up to my eyes and covered my entire neck. I’m all for protection and avoiding Covid spread, but I don’t breathe or sneeze or cough out my neck! Worst part is- no returns. Spend $$$ and get screwed.", "rating": "1.0 out of 5 stars"},
{"text": "So when I had told my grandmother to purchase these, I thought these would be a great fit. When we received them and I tried it on, I realized how cheap they were and the fact that they would slide off so much.Not only that, but if I was at a certain angle with these masks on, my glasses would slide off too! I’ve already ordered way better masks, but will use these as sort of a backup for my trip to California in September.All I have to say, is that the pictures they showed for these masks are NOT what they would actually look like in real life. If you’re looking to just buy backup masks, then buy these. If not, save your money and buy something better.", "rating": "2.0 out of 5 stars"},
{"text": "Purchased masks because needed masks but they do not fit your face at all. The nose portion goes up too far and is too big for your face. I have a large head and these masks are really big even for me. and the nose portion is just loose and flappy.. I would not purchase these again and am very disappointed. I will try and somehow fix the masks so that its not money wasted at least..", "rating": "1.0 out of 5 stars"},
{"text": "I work in real estate so I've been ordering different masks until I find the right coverage to prepare me once I get back  to work. These are cotton material,  dont quote me if its 100% but they are definitely comfy. I'm a plus size gal with a fuller face. This could be a wee bit smaller and would fit perfectly.  For kids? No way. But they're kinda cute, remind me of underwear though. Still great for what I need it for.", "rating": "5.0 out of 5 stars"},
{"text": "I really like the quality of the material.  It is not as hot as other masks.  My husband has a more square face, and they are too small for him. They pull on his ears, but they work well for a medium-sized woman.  With 4 in the set, I can keep one in my purse, one in the car, one is my husband's car and a spare for cleaning.  We washed them by hand right away, and they were dry by morning.", "rating": "5.0 out of 5 stars"},
{"text": "Not for physical labor activities. The material sucks into nose and/or mouth of breathing becomes slightly labored do you physical labor. I work In warehouse Climbing ladders and lifting and even if you take a slightly deep breath, the material just gets inhaled and you can’t breath. It’s a cute concept for someone who sits at a desk all day, but definitely not someone doing physical labor or even talking to people", "rating": "2.0 out of 5 stars"},
{"text": "I am very unhappy with these masks. I ordered them for my 5 yr old and they are too thin. In order to protect from the covid 19 virus you should not be able to blow out a candle and she CAN. These masks are completely useless because in order for her to wear them she has to have a layer of paper towel in the mask, which makes it uncomfortable for her. I am sorry I wasted my money.", "rating": "2.0 out of 5 stars"},
{"text": "I bought them for work. I bought the \"grey snake\" pack to coordinate with our work uniforms which are dark colors. They are a little bit big (I'm adult female). I can see it in my peripheral vision. They're fine. It's not like they don't fit at all. I'm not going to replace them or anything, they're just a little bit big for a female, in my opinion. Love that they come in different colors/patterns.", "rating": "4.0 out of 5 stars"},
{"text": "Sadly, these do not fit.... there is no wire or anything stiff in the top section to fit it closer to your nose...  It just gapes open....  worse part, is this company does not accept returns....  understandable during a pandemic...But had I known these would be so lame, I think I would have kept looking...  Cool color selection though.", "rating": "1.0 out of 5 stars"},
{"text": "Purchased for my 5 almost 6 year old and they fit.. but only just! After washing they are just BARELY able to hook over his ears. They are a solidly built, hold up to washing, and are great colors! Will do the job for now, but are probably not the most comfortable to wear for anything more than when he has to occasionally run into a store for a pick up with me.", "rating": "5.0 out of 5 stars"},
{"text": "We purchased these as a fun and colorful gift for my son starting preschool this month. Unfortunately, the packet we received was quite obviously used. It was open with the masks floating all around in the box. And one mask was missing! Totally unsanitary and completely defeats the purpose of a face mask!", "rating": "1.0 out of 5 stars"},
{"text": "Super comfortable, soft and covered at my cheekbones which I wanted", "rating": "5.0 out of 5 stars"},
{"text": "I am so happy with these masks.  Not only are they cute, but the fit is fantastic!  They have a seem down the middle, and rise above covering my entire nose, and come down below to cover my chin.  Perfect fit.  They don't pull on my ears.  They are not hot, and I even put a coffee filter inside of mine for extra \"coverage\" from Covid.  Very happy with these.", "rating": "5.0 out of 5 stars"},
{"text": "I have several brands of mask. This one is by far the best bang for your buck so long as they fit.. My only gripe is the cotton is a little thick (not so great for the summer). Not sure what people are so unhappy about. Its literally just 2 layers of cotton fabric with a couple ear loops. Works fine even with my glasses", "rating": "5.0 out of 5 stars"},
{"text": "I like that the mask fits high at the nose, and drops way under the eyes. It still fogs my glasses, but doesn't end-up poking me in the eyes. The strap around the ears does NOT stretch, making it pull on the ears, and not fit very well. I will try and change that to stretchable straps, like most mask have.  I would not buy this mask again.", "rating": "2.0 out of 5 stars"},
{"text": "Like many headed back to school, I got these to check for fit and comfort before buying a bunch. They were a hit, my girls liked the colors and they say they are comfortable. They are small, however. I measured according to instructions and ordered the big kid size, fit my 9yr old great but not my 11 yr old. I have ordered more in the larger size for the older  one.", "rating": "4.0 out of 5 stars"},
{"text": "I have ordered large for my husband, medium for me and the Big Kids for my 8yo and they have all worked just fine!  They do the job...  and we wear and wash and so far, they have all held up in multiple cycles in the washer.  I just reordered 2more orders of the Big Kid as an 8yo tends to misplace things.  They are double layered cotton, no wire, fit to the bridge of nose......not sure what everyone else is looking for, but I really like these masks for what they are.  They are breathable and the bright colors are easy to find when left in the car or couch etc.", "rating": "5.0 out of 5 stars"},
{"text": "I like the lightweight fabric of these but I ordered the size small for my 8 and 6 year old and they are a little small. The measurements were hard to use as it is hard to measure a face! The colors are fun and they do wash well and can be stretched to help with the fit.", "rating": "4.0 out of 5 stars"},
{"text": "I have a small head & normal face. Will not fit, will not stretch enough either. Kid may be able to wear them.", "rating": "1.0 out of 5 stars"},
{"text": "I accidentally put this in the washer and drier without putting it in a clothes mesh bag so when I took it out, it doesn’t fir well anymore and was loose on the upper mouth and nose part. So I would really suggest to put them in a clothes mesh bag before washing. Other than that, it was a good product and comfy.", "rating": "4.0 out of 5 stars"},
{"text": "They appear to be well sewn, no initial issues with manufacture.The Mediums are almost too small the large are too big.I haven't washed them yet, so I expect the large to fit and the medium to be a gift for a young teen.I'll continue shopping as these may not fit the bill.", "rating": "3.0 out of 5 stars"},
{"text": "Very thin material, ear pieces are just straps off material not elastic. I ordered the large/extra large and they are way to small for any adult. If course they're non returnable so jst a waste of money. I would just stick to the cheap surgical ones.", "rating": "1.0 out of 5 stars"},
{"text": "Don't waste your money! These are huge!! Even after washing them a few times & in very hot dryers. As soon as you lower the mask under your chin it stretches back out again. Completely useless after 1st wear & only after washing can you wear them at all.", "rating": "1.0 out of 5 stars"},
{"text": "It's so hard to find a good mask. Either they are too big, or too thick or pull my ears forward. These masks seem very well made, I love the color options and they stay on nicely, not pulling my ears. I hope they do not loosen up over time, but overall, very pleased with this purchase.", "rating": "5.0 out of 5 stars"},
{"text": "I bought the big kid size for my 10 and 11 year old. They fit the 10 perfectly and she loves them. They are a bit too small for the 11 year old. They do shrink when you was them but they are cotton, so that is not a surprise and they are easily stretched a bit again. Will buy more once they are available.", "rating": "4.0 out of 5 stars"},
{"text": "The quality it good.  The comfort is good, but the size is bad.  I chose small/medium for an oblong (long, slim) face.. didn't work.  So I'm going to return it and try someone else on Amazon.", "rating": "5.0 out of 5 stars"},
{"text": "I love the colors! The fit is awful. Gaps on the sides  no nose piece to hold it on and they are hot on the face. Oh yes, in my pack, the didn't all fit the same. :-(  I would say, Don't let the colors fool you. Look at another option. NOT RETURNABLE..", "rating": "2.0 out of 5 stars"},
{"text": "These are good for covering the nose, however, the ear loops are not adjustable. It would have been nice to have the ear pieces adjustable so that it doesn't hurt the ears. Also, the fabric around the nose area will stretch a little and not have a secure fit under the eyes. I bought these so that I could wear my glasses without fogging them...they still fog up...", "rating": "4.0 out of 5 stars"},
{"text": "NO REFUND AVAILABLE!!! Made in Guatemala.DO NOT waste your money on these masks.  NO RETURN POLICY available.  Yest, there is nowhere on the product description that says \"No return\".I should have read ALL the reviews.  The masks received DO NOT look like the photos.  T-shirt type material. NON stretching ear straps.  It pulls hard on the ears but are so big they go up to your eyes.  They do not seal well and are loose on the sides of your face.  DO NOT BUY!!!!", "rating": "1.0 out of 5 stars"},
{"text": "Very torn on how to review these. The adult large are huge. I cannot get them to stay on myself at all. They fit my husband okay, but he prefers the free masks from work. Returns are not allowed so we’re stuck with them. The “big kids” masks are perfect for my 10 year old. I’d prefer them to have an extra layer but the thinness is what she prefers. I am yet to find a mask to fit my 13 year old. The kids sizes are too little and the adult sizes, too big.", "rating": "3.0 out of 5 stars"},
{"text": "The mask I got were L/Xl because that is what was available I didn't think it would be that bad but its HUGE. if you don't mind the extra mask surface area, its pretty good. its very comfortable and even though its big its not gonna be a problem.", "rating": "5.0 out of 5 stars"},
{"text": "Well-made and nice stretchy fabric.  They are a tiny bit big for my four-year-old but I think I can shrink them a little bit.  Almost every mask I’ve purchased, from different manufacturers  has been big in some way.  I guess that’s how they get the to fit most people.  The fabric of these are soft and my daughter likes them.", "rating": "4.0 out of 5 stars"},
{"text": "It finally arrived after three separate delays. Wouldn’t you know it, I may have bought the wrong size. I bought the large/x-large thinking the smaller size would be tight but, it turns out the larger size may be a bit loose and long. It does give me coverage from my nose to my chin but, the material sticks out a bit from my face. I’ve bought the small/medium size set so, here’s hoping for a better fit (it’s not that much smaller from the large/x-large).", "rating": "4.0 out of 5 stars"},
{"text": "Mask is very soft and amazingly comfortable around ears with adjustable ear loops,  It covers well.  made well, I would recommend this!!", "rating": "5.0 out of 5 stars"},
{"text": "I really like these masks. They are comfortable, light-weight, are adjustable... (I really like that feature), and fits well.  I have a nose that turns up at the tip, and it is hard to find a mask that isn't mashing my poor nose.  I am very happy.", "rating": "5.0 out of 5 stars"},
{"text": "I ordered l-xl because I can find any that fit comfortably around the ears.  These don't either.  The front is so tall I have to fold it under to keep out of my eyes, but still pulls off the ears.  I'm not that big. Cheap paper mask fits, but can't find any cloth ones.", "rating": "3.0 out of 5 stars"},
{"text": "Comfortable for regular outdoor stroll use. For slightly strenuous activities where you start breathing heavily, the nose area collapses very easily and sits on your nostrils making it slightly uncomfortable to breathe. Otherwise, great overall product.The straps alone are ever so slightly stretchy but the entire elasticity of the mask allows for enough stretching to reach around the ears.Color is great in person. Doesn’t look cheap at all. Good look for daily wear and decent enough for fancy wear.", "rating": "4.0 out of 5 stars"},
{"text": "Overall, they are fine, and I do have a large face.  They are comfortable enough, I just wish the ear straps were about 1/4\" longer.  But hey do what they need to do, since most people won't be wearing them all day.  They're fine for shopping and running errands around town.", "rating": "4.0 out of 5 stars"},
{"text": "Since my 1st grade has to wear mask all day at school, we bought different kids to try out. Some have worked out, some haven't. These ones are great. They don't hurt his ears and he has no problem wearing them for the entire school day.", "rating": "5.0 out of 5 stars"},
{"text": "The fabric of the mask itself is good but the loop is very rigid, not sure if there's even an elastic in there. For that reason, the Big Kids mask did not fit my son. The item cannot be returned, so be sure that this is going to fit.", "rating": "2.0 out of 5 stars"},
{"text": "These masks seemed perfect when we took them out of the package.  When I washed them they shrunk too much. The masks are too small for my son.  They are soft cotton, but there is not enough stretch in the ear straps.  He has several cotton youth masks that fit him perfectly, but my son keeps loosing them at school.", "rating": "2.0 out of 5 stars"},
{"text": "I have a smaller head and these masks were EXTREMELY large. Even if I tie the ear loops, which make it more uncomfortable, there is still a large gap above my nose and under my chin. I tried to return, but returns are not allowed (although I can understand why).", "rating": "2.0 out of 5 stars"},
{"text": "Fit my two year old who wouldn't keep it on anyway. Pulls my four year old's ears forward. Wouldn't fit bigger kids I don't think. It covers nose and mouth all the way and even below chin and up to eyes but the straps don't stretch much so they pull on the ears too much.I got the pink, blue, stars and black set. It looks exactly like the picture as far as color. They're just thin but soft materials.", "rating": "4.0 out of 5 stars"},
{"text": "These are HUGE. I'm 6'3 210 lb and they fit me big. Threw all of them to the trash, not how I like to use money.", "rating": "1.0 out of 5 stars"},
{"text": "They are well made  but the straps for the ears are too short, at least for the little kids size, my daughter is a petite size for everything, the mask cover her face but the straps barely reached her ears, wich makes very difficult to wear it, we had to replace the straps with elastic.", "rating": "4.0 out of 5 stars"},
{"text": "This product is just “okay”. Very thin cotton material & no inside pocket for filter. They ARE NOT ideal for all day wear at school in my opinion. However the masks are made and put together very well with strong stitching and cotton ear straps.", "rating": "3.0 out of 5 stars"},
{"text": "Buy some something else. The cut shape of these is awful and the medium/large size is huge. The ear loops are not made with stretchy material so they dont give at all. 3 star review because they are a basic cloth mask but I would not recommend", "rating": "3.0 out of 5 stars"},
{"text": "I hope I can return this.  I bought this one (non-adjustable) and another brand (adjustable).  The latter, even without making any adjustments, fit larger than these \"Durables\".  If you believe you need a large/x-large, DO NOT purchase this item.  It'll put a strain on your ears and be very uncomfortable even for a short time.", "rating": "1.0 out of 5 stars"},
{"text": "I bought a package of these at my local Amazon Store, I just happened to be in there doing a return and they were at the checkout. They launder well, fit well and look smart. I bought 2 more packages, so I think I may have enough to ride out the pandemic... I hope.", "rating": "5.0 out of 5 stars"},
{"text": "I am fine with the quality but I chose a \"Little Kids: Small\" and these will only fit an INFANT.  Luckily I know one so I will pass these along but I would only recommend this size to a newborn ...or a DOLL!", "rating": "3.0 out of 5 stars"},
{"text": "Nice selection of colors, comfy fit, and well made. My only gripe is that the inside layer's front/center seam folds toward the mouth on all of them, so it constantly touches my lips. Might just be personal preference, but I still wear them and I like the fit. The flare at the top to go over the nose is great at fitting beneath my glasses so they don't fog up when I breathe, and that's a big plus.", "rating": "4.0 out of 5 stars"},
{"text": "Horrible! Just got these today and these are the worst masks I’ve ever had. The ear loops have no elastic and are just pieces of cloth. The size xl adult is more like a kid’s size.Wish I had never ordered these!", "rating": "1.0 out of 5 stars"},
{"text": "So I have a small face. That being said my ears are also small. This mask STILL pulls my ears down, but yet takes up my whole face. I had to stretch the ear loops out and rip a couple seems for It to not pull my ears as badly. It’s pretty oddly fitting. But it is light weight and washable. So I guess you win some you lose some. It was waaaaat to big for my kids. It literally covered their nose mouth and neck. They hated it.", "rating": "4.0 out of 5 stars"},
{"text": "this isn't going to keep you from getting the virus because it isn't thick. it doesn't hurt to wear around the ears though and you can breathe with it on. it works great for when you just want to through on a mask to be compliant with local rules/laws.", "rating": "4.0 out of 5 stars"},
{"text": "We bought these for our daughter because while going to theme parks she was having issues with her other ones falling off or irritating her.  We got these, and zero issues now.  They stay on perfectly, comfortable fit, and not too heavy so she can still breathe.", "rating": "5.0 out of 5 stars"},
{"text": "These are nice masks, but the Big Kids size will not fit our very thin/athletic 8 year old. We got the adult size and they are too bug on her, but the Big Kids won't even reach her ears. They are not returnable, so out the money.Looked at measurements and these are not the Big Kids size that they say. Proceed with caution when purchasing.", "rating": "1.0 out of 5 stars"},
{"text": "I have tried several masks, to no avail. Every mask I've bought was too small for my face. I got the large/extra large mask and they fit GREAT!! Sooo Happy! They are soft, easy to breathe through. I'm waiting for the other colors to come in stock, so I can have a variety of colors to match outfits.", "rating": "5.0 out of 5 stars"},
{"text": "I do not prefer these masks. The face part is SO large over my face, and it just kind of hangs down towards my neck. The ear loops are the main problem because they aren't elastic or adjustable. I had to wash and dry a few times to make them fit slightly better. Or, I have to twist the extra earloop behind my ear so that the mask won't fall below my nose. Cute colors, but a bad mask.", "rating": "2.0 out of 5 stars"},
{"text": "These fit me and my husband just fine. They are thin so ok to breath out of, the ear bands feel ok too. Like with any other face masks- they will fog up glasses when wearing them. I’m not a fan of masks in general but these aren’t too bad.", "rating": "5.0 out of 5 stars"},
{"text": "These are huge even for an adult. Not only do they take up your entire lower face but they come so far down under your chin. They were cheap so we will keep them as extras, but they need to be a full size smaller", "rating": "2.0 out of 5 stars"},
{"text": "Disappointed. You’d figure that these would fit a 5 year old. Nope. They pull her ears forward so she cannot use them. Now I’m stuck with useless masks because the “item can not be returned.” Wow thanks...", "rating": "1.0 out of 5 stars"},
{"text": "I think it was too big for me, it falls off or just slips and let's my nose out (my complexion is petite so it might fit right for someone else). I just dont feel the material is right, it's like wearing a shirt on the face. Doesn't protect much,  but for any emergency they are ok. I would put a filter and fix the size though. Still 4 for $8 is a good price. The shipment was fast, got one day before expected date.I bought them for emergencies so by fixing them they will work for its purpose.", "rating": "1.0 out of 5 stars"},
{"text": "this was a little bigger than expected.it fits kind of tight right after washing but later on it stretches out and feels too big.colors are good and the comfort was alright though.", "rating": "4.0 out of 5 stars"},
{"text": "Ordered these at the beginning of the COVID-19 pandemic and they were a great choice. You get 4 masks for a steal, some stores were selling single masks for $5-10. These do shrink a bit in the wash so plan for them to get a bit smaller than how they arrive. Tried the \"blow out a candle\" test with them and was unable to, but unsure of their CDC compatibility outside of that. Well made, and would reorder these if needed.", "rating": "4.0 out of 5 stars"},
{"text": "I ordered the small/medium and they are huge - all different sizes, even if you twist the part around your ear its still so LONG it covers your entire face!!  I guess that would be one way to stay safe ... do not waste you money they are non refundable!!!", "rating": "1.0 out of 5 stars"},
{"text": "Ordered the “little kids” size for my average sized 5-year-old. They’re almost too small! We had to stretch them a bit to fit better. I measured before ordering, and the “big kids” would have been way too loose.", "rating": "4.0 out of 5 stars"},
{"text": "These masks fit my 15 yr. old daughter's face perfectly and they don't slide down or make her sweaty.  We've tried many and so far these are most comfortable for her and she loves the pastel colors.", "rating": "5.0 out of 5 stars"},
{"text": "These were a little small but it’s okay. They fit a 4 year old and a very small 8 year old. They look super cute on!! My kids wore them to Dollywood and they served the purpose of required mask. I am not worried about the thickness of these mask. My kids were able to breath on hot days.", "rating": "4.0 out of 5 stars"},
{"text": "These are definitely child sized--they fit my 2 and 8 year old, but they are a little tight on my 11 year old. They are thin and single layer, so they probably aren't really good protection if that's what you are looking for. We are using them for Halloween costumes, and they are going to work well for that.", "rating": "4.0 out of 5 stars"},
{"text": "Not worth it, its only one layer and it gets so wet from the moisture. I had to change my kids mask at least 3 times whenever we went out because you could see how wet it was. They do run small, it barely fit my 4 year old. I did receive fast shipping with this order, it got here the very next day.", "rating": "3.0 out of 5 stars"},
{"text": "I was hoping to like these as masks are not very comfortable. I don't usually post reviews but I do have to tell you these look like underwear on your face! Especially in white and light gray. I would go with the black if any to escape the underwear effect.", "rating": "1.0 out of 5 stars"},
{"text": "I ordered \"big kid\" size, definitely not for big kids. Width (nose to chin) fits great. However ear to ear is to small. My daughter is 8, and average size. I would size up. The Star fabric was faded, the others looked great. Quality wise, product is good.3", "rating": "3.0 out of 5 stars"},
{"text": "I purchased this item for my almost 9 year old daughter for her to attend school. When this item arrived it was extremely small and would not come close to fitting her. I gave them to a friend, since this item isn't returnable, who has a 3 year old and they do not fit her either!  I purchased a product that was given the option of Adult or Child. I choose child, not expecting this to fit a 2 year old or younger. Very unhappy with this purchase. I do not appreciate the deceit this sale item was listed at. I do not recommend anyone to purchase this item at all.", "rating": "1.0 out of 5 stars"},
{"text": "I bought these for my 10 year old and we are happy with them.  She thinks they're comfortable and fit well. All things considered, they look cute on her. I'm pleased with the purchase and would recommend these.", "rating": "5.0 out of 5 stars"},
{"text": "Ordered xl masks and they are massive!! There’s no curve to them they are flat and they stand out at the chin and nose. Waste of money, I ordered them to match my husbands uniform, and they do so I like that.", "rating": "2.0 out of 5 stars"},
[
{"text": "I got these for my 8 and 10 year old boys, and they fit great. My son said they are comfortable and soft.", "rating": "5.0 out of 5 stars"},
{"text": "CAUTION: This is NOT RETURNABLE. In spite of it being sold by Amazon. Please be aware.The sizing is inconsistent and shrinks beyond a comfortable fit. The manufacturer could’ve preshrunk at the very least.During this pandemic, we are all learning about quality controls and responsible manufacturing, or lack thereof, among vendors on Amazon, if not, Amazon itself.Most of us with long enough histories with Amazon, learned early on that poor quality and product oversight was not a given with Amazon. Sadly, not even with products bearing the Amazon name.Herewith, another case in point and a buyer warning. TAKEAWAY: Don’t buy these, and confirm 100% refund before purchasing anything on Amazon. No matter if it’s sold by them.", "rating": "1.0 out of 5 stars"},
{"text": "When these first arrived, the first thing I noticed was how large they appeared. I got them to replace the disposable ones that my fiance and I have been using, because they felt wasteful. I purchased the small/medium and the large/x-large, thinking we'd need two different sizes since I'm much smaller than he is. The Small/medium arrived first and were too big even for him. I washed them and they did appear to shrink a little, but after wearing them for one outing, they stretched out again. I think these do the trick if you're wearing them for a few minutes at the time, and if you wash them...after every use? I would save your money and buy something else.I haven't even opened the large ones, I'll probably just return them.", "rating": "3.0 out of 5 stars"},
{"text": "It fits perfectly with size large. I am 6\" and 185lbs. I have tried a few different  masks but these fits me way better than others.", "rating": "5.0 out of 5 stars"},
{"text": "El tamaño es demasiado grande , mi estatura es de 1.87 metros ,cuerpo robusto y aun así me quedo grande , no me gustaron", "rating": "1.0 out of 5 stars"},
{"text": "At this price for four masks for my children, I thought it was worth taking a chance on the product. It was not. I washed they before use on a delicate cycle and hung them to dry. They are already coming apart, and that's before the kids even had a chance to wear them. They are also pretty thin and quality seems to be off. Again, I'm not surprised as it was by far the cheapest fabric masks I've seen, so I guess you get what you pay for.", "rating": "1.0 out of 5 stars"},
{"text": "I was having trouble getting my son masks that didn’t hurt his ears (he was getting sores behind his ears from the hard string /fabric ) and ones that actually fit his little 4 year old face :) so I came across these ones and took a chance! There cute , soft but not so soft to where they are flimsy .... cool colors which was a plus! The ear wrap is very gentle and he never had red ears or complained +++++++ thank goodness! Machine washable . There isn’t a filter or anything but for my little guy we never plan to be out long or in bit groups of people so that’s not a issue for us .... for the color ,quality , and fast shipping it’s worth it to me", "rating": "5.0 out of 5 stars"},
{"text": "Kids size fits my average sized 6 year old daughter but was too tight for my tall 9 year old. Thinner soft comfy material, easy to wear", "rating": "5.0 out of 5 stars"},
{"text": "The masks themselves are as pictured, and I actually do like this type of sort of jersey knit mask (like T-shirt material), but the sizing is way off, at least for the \"Big Kids\" size.  I don't know what they deem a big kid, but I would think at least maybe 8 or 10 years old, would be a big kid right?  This would probably fit up to maybe pre-K or 5 years old.  Oh, and BEWARE...these are not returnable via the usual Amazon returns due to hygiene concerns.  I had to go through Customer Service (chat) to get them to refund my money (which they graciously did, but it was a bit of a hassle).  I guess I'll look for another source for masks, now that I know you can't return these if they don't fit.", "rating": "2.0 out of 5 stars"},
{"text": "Wired design where the strings over the ears are too short and the mask too big. We had three people try the masks and these just don't fit tight whatsoever (don't seal the face in and big gaps on the sides). Be aware you can't return this item. Wouldn't order them again.", "rating": "1.0 out of 5 stars"}
]